{
    "DiscoveredInfo": "¡Éxito! ¡%s dispositivos descubiertos en la cuenta de la nube conectada! El proxy se apagará en 15 segundos",
    "E-Mail": "Email",
    "EmailPassword": "Iniciar sesión con correo electrónico y contraseña",
    "Password": "Clave",
    "Polling Interval": "Intervalo de sondeo (si el dispositivo no se sincronizó con la aplicación)",
    "Proxy": "Alternativa: iniciar sesión a través de proxy",
    "Proxy External IP": "Proxy IP externa (opcional, uso para Docker)",
    "Proxy Port": "Puerto proxy",
    "Proxy Web Info Port": "Puerto proxy SSL-Zertifikat",
    "Proxy-Info": "Para poder ver y controlar sus dispositivos Daikin que están conectados a su cuenta en la nube de Daikin y la aplicación Onecta, necesita conectar este adaptador con su cuenta en la nube una vez. Esto se hace mediante <b>correo electrónico y contraseña</b> o utilizando el <b>adaptador Web-Proxy</b> en su conexión WLAN junto con un certificado SSL.<br/><br/> Si obtiene un error de inicio de sesión al usar el correo electrónico y la contraseña que necesita resolver un Captcha, siga las instrucciones en la <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md\" target=\"_blank\">página LÉAME</a> .<br/><br/> Puede encontrar más información sobre el uso del Proxy en la <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/PROXY.md\" target=\"_blank\">página PROXY</a><br/><br/> Inicie el proxy con el botón de la derecha y siga las instrucciones adicionales.",
    "ProxyInfoText": "Si necesita un segundo intento, asegúrese de volver a cargar la página inicial que se muestra en cualquier momento, de lo contrario, el proceso fallará.",
    "ProxySteps": "Haga clic en el código QR para iniciar el proceso de proxy en esta computadora o escanee el código QR con su teléfono móvil.",
    "Start proxy": "Iniciar proxy (sea paciente, puede tardar unos segundos)",
    "StatusInfo": "Estado: %s dispositivos encontrados en la cuenta de la nube conectada, %s dispositivos están en línea",
    "Stop proxy": "Detener proxy",
    "daikin-cloud adapter settings": "Ajustes del adaptador para daikin-cloud"
}
