{
    "auth_header": "Proceso de autenticación con instrucciones de Daikin Cloud",
    "auth_link": "Regístrese en el portal para desarrolladores de Daikin Europa",
    "auth_step1": "1. Asegúrese de que la instancia de administrador que utiliza para la siguiente autenticación <b>tenga HTTPS habilitado.</b> si no, utilice una segunda instancia de administrador.",
    "auth_step2": "2. Regístrese para obtener una cuenta de desarrollador de Daikin y agregue una \"aplicación\" allí para obtener una identificación y un secreto de cliente. Puede dejar el campo \"URL de redireccionamiento\" vacío para este paso de registro.",
    "auth_step3": "3. Ingrese el ID del cliente y el secreto en los campos a continuación.",
    "auth_step4": "4. Presione este botón para obtener la URL de redireccionamiento... (Ignore el título \"Error\" de la ventana emergente)",
    "auth_step5": "5. Edite la aplicación en el Portal para desarrolladores de Daikin y agregue la URL de redireccionamiento que obtuvo en el paso anterior.",
    "auth_step6": "6. Presione el siguiente botón para autenticarse con Daikin Cloud en una nueva ventana/pestaña. Si la ventana no se abre, <b>verifique la configuración de su bloqueador de ventanas emergentes para permitir ventanas emergentes</b>.",
    "auth_step7": "7. Autenticarse con Daikin Cloud",
    "auth_step8": "8. Después de la autenticación exitosa y después de ver la página de éxito en la otra ventana, guarde la configuración y presione el botón \"Guardar y cerrar\" a continuación.",
    "polling_header": "Intervalos de sondeo de datos",
    "polling_info": "La nube de Daikin introduce limitaciones de velocidad para la API. ¡El límite principal es <b>un máximo de 200 solicitudes por día</b>! Utilice el sondeo lento en momentos en los que no se necesitan actualizaciones frecuentes. ¡Establezca el estado <b>useSlowPolling</b> en verdadero para utilizar el intervalo de sondeo lento! Los detalles más recientes sobre los límites de tarifas se pueden encontrar en info.* estados.",
    "polling_interval": "Intervalo de sondeo de datos (segundos)",
    "polling_interval_slow": "Intervalo de sondeo de datos lento (segundos)",
    "same_value_header": "¿Qué valores enviar a Daikin?",
    "same_value_info": "Para reducir al máximo las interacciones con la nube de Daikin, puede definir aquí qué valores deben enviarse a la nube de Daikin.",
    "sendSameValue": "¿Enviar los mismos valores otra vez?"
}
