{
  "common": {
    "name": "daikin-cloud",
    "version": "0.4.12",
    "news": {
      "0.4.12": {
        "en": "Always send writable entries to the device, irrelevant of status, always update local values\nOptimize role detection for some states\nTried to prevent too luch logging of the same error in a short time on Wifi issues",
        "de": "Senden Sie immer schreibbare Einträge an das Gerät, irrelevant für den Status, immer lokale Werte aktualisieren\nOptimieren Sie die Rollenerkennung für einige Staaten\nVersucht, zu luch Protokollierung des gleichen Fehlers in kurzer Zeit auf Wifi-Probleme zu verhindern",
        "ru": "Всегда отправляйте записи на устройство, не относящиеся к статусу, всегда обновляйте локальные значения\nОптимизация ролевого обнаружения для некоторых стран\nПытался предотвратить слишком много ошибок в Wi-Fi за короткое время",
        "pt": "Sempre envie entradas para o dispositivo, irrelevante de status, sempre atualize valores locais\nOtimizar a detecção de funções para alguns estados\nTentei evitar o registro demasiado luch do mesmo erro em pouco tempo em questões Wifi",
        "nl": "Stuur altijd schrijfbare items naar het apparaat, irrelevant van status, altijd lokale waarden bijwerken\nOptimaliseer roldetectie voor sommige staten\nGeprobeerd om te veel logging van dezelfde fout in een korte tijd op Wifi-problemen te voorkomen",
        "fr": "Toujours envoyer des entrées en écriture sur le périphérique, sans rapport avec le statut, toujours mettre à jour les valeurs locales\nOptimiser la détection des rôles pour certains états\nEssayé d'éviter un enregistrement trop louche de la même erreur en peu de temps sur les problèmes Wifi",
        "it": "Invia sempre le voci scrivibili al dispositivo, irrilevante dello stato, aggiorna sempre i valori locali\nOttimizzare il rilevamento dei ruoli per alcuni stati\nHo cercato di evitare troppo luch registrazione dello stesso errore in breve tempo su problemi Wifi",
        "es": "Enviar siempre entradas de escritura al dispositivo, irrelevante del estado, siempre actualizar los valores locales\nOptimize role detection for some states\nTrató de prevenir el registro demasiado exuberante del mismo error en poco tiempo en problemas de Wifi",
        "pl": "Zawsze wysyłaj wpisy do urządzenia, bez względu na status, zawsze aktualizuj wartości lokalne\nOptymalizacja wykrywania ról dla niektórych państw\nPróbowałem zapobiec zbyt luch logowanie tego samego błędu w krótkim czasie na Wifi problemów",
        "uk": "Завжди надішлемо чіткі записи до пристрою, незалежно від стану, завжди оновлювати локальні значення\nОптимальне визначення ролі для деяких держав\nВипробувано, щоб уникнути занадто luch журналювання тієї ж помилки в короткий час на питаннях Wifi",
        "zh-cn": "总是向设备发送可写条目, 与状态无关, 总是更新本地值\n优化对某些州的角色检测\n试图在短短的时间内防止同样错误的过度记录 Wifi 问题"
      },
      "0.4.11": {
        "en": "Increase communication timeout to 10s to prevent refresh issues",
        "de": "Erhöhen Sie die Kommunikationszeit auf 10er Jahre, um Erfrischungsprobleme zu verhindern",
        "ru": "Увеличить время связи до 10-х, чтобы предотвратить проблемы обновления",
        "pt": "Aumentar o tempo de comunicação para 10s para evitar problemas de atualização",
        "nl": "Verhoog de communicatie timeout tot 10s om verfrissingen te voorkomen",
        "fr": "Augmenter le délai de communication à 10 pour prévenir les problèmes de rafraîchissement",
        "it": "Aumentare il timeout di comunicazione a 10s per evitare problemi di aggiornamento",
        "es": "Aumentar el tiempo de comunicación a 10s para evitar problemas de actualización",
        "pl": "Zwiększenie czasu komunikacji do 10s, aby uniknąć problemów odświeżania",
        "uk": "Збільшити час спілкування до 10-х, щоб запобігти проблемам з оновленням",
        "zh-cn": "将通信超时时间增加到10小时,以防止出现新问题"
      },
      "0.4.10": {
        "en": "Fixes some error cases reported by Sentry",
        "de": "Behebt einige von Sentry gemeldete Fehlerfälle",
        "ru": "Исправления некоторых случаев ошибок, о которых сообщает Sentry",
        "pt": "Corrige alguns casos de erro relatados pela Sentry",
        "nl": "Repareert een aantal fouten gemeld door Sentry",
        "fr": "Correction de certains cas d'erreur signalés par Sentry",
        "it": "Risolve alcuni casi di errore segnalati da Sentry",
        "es": "Arregla algunos casos de error reportados por Sentry",
        "pl": "Określa niektóre przypadki błędów zgłoszone przez Sentry",
        "uk": "Виправлення деяких випадків помилок, які повідомляються Sentry",
        "zh-cn": "纠正哨兵报告的一些错误案例"
      },
      "0.4.9": {
        "en": "Optimized write handling",
        "de": "Optimiertes Schreibhandling",
        "ru": "Оптимизированная обработка записи",
        "pt": "Manipulação de gravação otimizada",
        "nl": "Geoptimaliseerde schrijfbehandeling",
        "fr": "Gestion optimisée de l'écriture",
        "it": "Gestione ottimizzata della scrittura",
        "es": "Manejo de escritura optimizado",
        "pl": "Zoptymalizowana obsługa zapisu",
        "uk": "Оптимізована обробка запису",
        "zh-cn": "优化写处理"
      },
      "0.4.8": {
        "en": "Optimized handling of rate limits, block maximum 24h and retry then\nAdded option to prevent sending the same values again (prevented by default!)",
        "de": "Optimiertes Handling von Geschwindigkeitsgrenzen, Block maximal 24h und Retry dann\nOption hinzugefügt, um zu verhindern, dass die gleichen Werte wieder gesendet werden (vorbeugt durch Standard!)",
        "ru": "Оптимизированная обработка лимитов скорости, блок максимум 24h и ответный затем\nДобавлена опция для предотвращения отправки одних и тех же значений снова (предназначена по умолчанию!)",
        "pt": "Manuseamento otimizado de limites de taxa, bloquear o máximo 24h e retentar então\nAdicionado opção para evitar o envio dos mesmos valores novamente (prevenido por padrão!)",
        "nl": "Geoptimaliseerde hantering van snelheidslimieten, blokkeer maximaal 24 uur en probeer het dan opnieuw\nToegevoegde optie om het opnieuw verzenden van dezelfde waarden te voorkomen (standaard uitgevonden!)",
        "fr": "Manipulation optimisée des limites de vitesse, bloc maximum 24h et réessayer ensuite\nAjout d'une option pour empêcher l'envoi des mêmes valeurs à nouveau (préventé par défaut!)",
        "it": "Movimentazione ottimizzata dei limiti di tasso, bloccare massimo 24 ore e riprovare poi\nAggiunta opzione per evitare di inviare nuovamente gli stessi valori (preventato per impostazione predefinita!)",
        "es": "Manejo optimizado de los límites de velocidad, bloque máximo 24h y retry luego\nAñadido opción para evitar el envío de los mismos valores de nuevo (prevenido por defecto!)",
        "pl": "Zoptymalizowane obchodzenie się z limitami prędkości, zablokować maksymalnie 24h i ponownie spróbować\nDodano opcję, aby zapobiec ponownemu wysyłaniu tych samych wartości (domyślnie zapobiegane!)",
        "uk": "Оптимізоване обслуговування лімітів швидкості, блокування максимальної 24h і птиця, потім\nДодано параметр для запобігання відправки однакових значень знову (перевірено за замовчуванням!)",
        "zh-cn": "优化处理速率限制,区块最高24小时,然后重试\n添加了选项, 防止再次发送相同的值( 默认已防止 !)"
      },
      "0.4.7": {
        "en": "Handles initialization issue where objects could be deleted wrongly\nAlso check for HTTPS usage when returning the redirect URL",
        "de": "Problem der Initialisierung, wo Objekte falsch gelöscht werden könnten\nÜberprüfen Sie auch die HTTPS-Nutzung, wenn Sie die Redirect URL zurückgeben",
        "ru": "Проблема инициализации, когда объекты могут быть удалены неправильно\nТакже проверьте использование HTTPS при возврате URL перенаправления",
        "pt": "Lida o problema de inicialização onde os objetos podem ser excluídos incorretamente\nVerifique também o uso do HTTPS ao retornar o URL de redirecionamento",
        "nl": "Behandelt initialisatie probleem waar objecten foutief kunnen worden verwijderd\nControleer ook op HTTPS gebruik bij het terugsturen van de redirect URL",
        "fr": "Gère la question de l'initialisation où les objets pourraient être supprimés à tort\nVérifiez également l'utilisation de HTTPS lors du retour de l'URL de redirection",
        "it": "Manici problema di inizializzazione in cui gli oggetti potrebbero essere eliminati in modo errato\nControllare anche l'utilizzo HTTPS quando si ritorna l'URL redirect",
        "es": "Tema de inicialización de las manijas donde se pueden eliminar objetos erróneamente\nTambién compruebe el uso de HTTPS al devolver la URL redireccionada",
        "pl": "Obsługa problemu inicjalizacji, w którym obiekty mogą zostać usunięte nieprawidłowo\nSprawdź również czy HTTPS jest używany podczas zwracania przekierowanego adresu URL",
        "uk": "Питання ініціалізації рук, де об'єкти можуть бути видалені неправильно\nТакож перевірте використання HTTPS при поверненні URL-адреси",
        "zh-cn": "处理可错误删除对象的初始化问题\n返回重定向 URL 时还检查 HTTPS 使用情况"
      },
      "0.4.6": {
        "en": "Update dependencies with optimizations and second blocking layer for rate limiting",
        "de": "Aktualisieren von Abhängigkeiten mit Optimierungen und zweiter Sperrschicht zur Ratenbegrenzung",
        "ru": "Зависимости обновления с оптимизациями и второй блокирующий слой для ограничения скорости",
        "pt": "Atualize dependências com otimizações e segunda camada de bloqueio para limitar a taxa",
        "nl": "Afhankelijkheden bijwerken met optimalisaties en tweede blokkeringslaag voor snelheidsbeperking",
        "fr": "Mettre à jour les dépendances avec les optimisations et la deuxième couche de blocage pour limiter le taux",
        "it": "Aggiornare le dipendenze con le ottimizzazioni e il secondo strato di bloccaggio per limitare i tassi",
        "es": "Actualizar las dependencias con optimizaciones y segunda capa de bloqueo para limitar la tasa",
        "pl": "Aktualizuj zależności z optymalizacjami i drugą warstwą blokującą dla ograniczenia prędkości",
        "uk": "Оновлення залежності з оптимізацією та другим шаром блокування для обмеження швидкості",
        "zh-cn": "更新具有优化的依赖性和限制费率的第二个阻塞层"
      }
    },
    "titleLang": {
      "en": "Daikin Cloud",
      "de": "Daikin Cloud",
      "ru": "Daikin Cloud",
      "pt": "Daikin Cloud",
      "nl": "Daikin Cloud",
      "fr": "Daikin Cloud",
      "it": "Daikin Cloud",
      "es": "Nube Daikin",
      "pl": "Chmura Daikin",
      "zh-cn": "大金云",
      "uk": "Daikin Cloud"
    },
    "desc": {
      "en": "Control Daikin Devices that are only connected to the Daikin Cloud",
      "de": "Steuern Sie Daikin-Geräte, die nur mit der Daikin-Cloud verbunden sind",
      "ru": "Управление устройствами Daikin, подключенными только к Daikin Cloud",
      "pt": "Controlar dispositivos Daikin que estão conectados apenas à nuvem Daikin",
      "nl": "Beheer Daikin-apparaten die alleen met de Daikin Cloud zijn verbonden",
      "fr": "Contrôlez les appareils Daikin qui sont uniquement connectés au Daikin Cloud",
      "it": "Controlla i dispositivi Daikin che sono collegati solo a Daikin Cloud",
      "es": "Controle los dispositivos Daikin que solo están conectados a Daikin Cloud",
      "pl": "Kontroluj urządzenia Daikin, które są podłączone tylko do chmury Daikin",
      "zh-cn": "控制仅连接到大金云的大金设备",
      "uk": "Керуйте пристроями Daikin, які підключені лише до Daikin Cloud"
    },
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "keywords": [
      "Daikin",
      "Daikin Cloud"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "daikin-cloud.jpg",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.daikin-cloud/master/admin/daikin-cloud.jpg",
    "readme": "https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "messagebox": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "tier": 2,
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.17.14"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<0.4.0",
            "newVersion>=0.4.0"
          ]
        },
        "title": {
          "en": "Breaking Change: Daikin Developer Account needed!",
          "de": "Wichtige Änderung: Daikin Entwickler Konto erforderlich!",
          "ru": "Breaking Change: Daikin Developer Счет нужен!",
          "pt": "Mudança de ruptura: Daikin Developer Conta necessária!",
          "nl": "Breaking Change: Daikin Developer Account nodig!",
          "fr": "Breaking Change: Daikin Developer Compte nécessaire !",
          "it": "Cambiamento di rottura: Daikin Sviluppatore Conto necessario!",
          "es": "Cambio de ruptura: Daikin Developer ¡Cuenta necesaria!",
          "pl": "Łamanie zmian: Programista Daikin Potrzebne konto!",
          "uk": "Зміна несправностей: Daikin Developer Облік необхідно!",
          "zh-cn": "突破更改: Daikin 开发者 需要账户!"
        },
        "text": {
          "en": "Starting with v0.4.0 a Daikin Developer Account is needed now and there is a new maximum of <b> 200 requests per day!</b> Please Follow the instructions on the Admin configuration page after updating and adjust your scripts to prevent issues with the maximum requests per day!",
          "de": "Beginnend mit v0.4.0 ein Daikin Developer Konto ist jetzt erforderlich und es gibt ein neues Maximum von <b> 200 Anfragen pro Tag!</b> Bitte nach dem Update die Anweisungen auf der Admin-Konfigurationsseite befolgen und eigene Skripte anpassen, um Probleme mit den maximalen Anfragen pro Tag zu verhindern!",
          "ru": "Начиная с v0.4.0 Счет нужен сейчас, и есть новый максимум <b> 200 запросов в день!</b> Пожалуйста, следуйте инструкциям на странице настройки Админ после обновления и корректировки сценариев, чтобы предотвратить проблемы с максимальными запросами в день!",
          "pt": "Começando com v0.4.0 a Daikin Developer A conta é necessária agora e há um novo máximo de <b> 200 pedidos por dia!</b> Siga as instruções na página de configuração do administrador após atualizar e ajustar seus scripts para evitar problemas com os pedidos máximos por dia!",
          "nl": "Te beginnen met v0.4.0 a Daikin Developer Account is nu nodig en er is een nieuw maximum van <b> 200 verzoeken per dag!</b> Volg de instructies op de Admin configuratie pagina na het bijwerken en aanpassen van uw scripts om problemen met de maximale verzoeken per dag te voorkomen!",
          "fr": "En commençant par v0.4.0 un développeur Daikin Le compte est nécessaire maintenant et il y a un nouveau maximum de <b> 200 demandes par jour!</b> Suivez les instructions sur la page de configuration Admin après la mise à jour et ajustez vos scripts pour éviter les problèmes avec le maximum de demandes par jour!",
          "it": "A partire da v0.4.0 a Daikin Developer L'account è necessario ora e c'è un nuovo massimo di <b> 200 richieste al giorno! Seguire le istruzioni sulla pagina di configurazione di Admin dopo l'aggiornamento e la regolazione degli script per evitare problemi con le richieste massime al giorno!",
          "es": "Empezando con v0.4.0 a Daikin Developer ¡La cuenta es necesaria ahora y hay un nuevo máximo de <b título 200 solicitudes por día! Siga las instrucciones en la página de configuración de Admin después de actualizar y ajustar sus scripts para evitar problemas con las solicitudes máximas por día!",
          "pl": "Począwszy od v0.4.0 a Daikin Developer Konto jest teraz potrzebne i istnieje nowe maksimum < b > 200 wniosków dziennie! < / b > Proszę postępować zgodnie z instrukcjami na stronie konfiguracji Admin po aktualizacji i dostosować skrypty, aby zapobiec problemom z maksymalnymi żądaniami dziennie!",
          "uk": "Починаючи з v0.4.0 розробник Daikin Акаун зараз і є новий максимум запитів <b> 200 на день!</b> Будь ласка, дотримуйтесь інструкцій на сторінці налаштування адміністратора після оновлення та налаштування сценаріїв, щоб запобігти проблемам з максимальними запитами в день!",
          "zh-cn": "从 n. 4. 0 开始 Daikin 开发者 现在需要核算,新的最高要求为每天<b>200个请求!</b> 请在更新和调整您的脚本后, 遵守行政配置页面上的指示, 以防止每天最多的请求出现问题 !"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ],
    "blockedVersions": [
      "<0.4.0"
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://3ac7b6d04c3e4faf8c0bfe0cd38396a6@sentry.iobroker.net/197",
        "pathWhitelist": [
          "@apollon",
          "daikin-controller-cloud"
        ]
      }
    }
  },
  "encryptedNative": [
    "clientId",
    "clientSecret"
  ],
  "protectedNative": [
    "clientId",
    "clientSecret"
  ],
  "native": {
    "clientId": "",
    "clientSecret": "",
    "pollingInterval": 900,
    "slowPollingInterval": 1800,
    "sendSameValue": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.rateLimitMinute",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Rate Limit per minute",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateRemainingMinute",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Remaining rate Limit per minute",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateLimitDay",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Rate Limit per day",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateRemainingDay",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Remaining rate Limit per day",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "_config",
      "type": "config",
      "common": {
        "name": "Token data for Daikin Onecta cloud",
        "expert": true
      },
      "native": {
        "tokenSet": null
      }
    },
    {
      "_id": "useSlowPolling",
      "type": "state",
      "common": {
        "role": "switch",
        "name": "Use Slow polling interval for e.g night times",
        "type": "boolean",
        "read": true,
        "write": true,
        "def": false
      },
      "native": {}
    }
  ]
}
