{
  "common": {
    "name": "daikin-cloud",
    "version": "0.4.3",
    "news": {
      "0.4.3": {
        "en": "IMPORTANT: Minimum Node.js version is 18.2\nBREAKING: Adjusted to new Daiking Cloud API - You need to reauthenticate!\nBREAKING: New rate limit of new API is 200 requests per day!! Adjust your usage!\nAdded option to set \"slow polling\" interval\nMake electrical data available as states (arrays for now)\nRestore last data updated timestamp\nMake sure cloudConnection always contains a boolean\nRefresh token also when error is \"Refresh Token has expired\"",
        "de": "WICHTIG: Minimum Node.js-Version ist 18.2\nBREAKING: Anpassung an neue Daiking Cloud API - Sie müssen neu authentifizieren!\nBREAKING: Neue Rate Limit der neuen API ist 200 Anfragen pro Tag!! Passen Sie Ihre Nutzung an!\nOption hinzugefügt, um \"slow polling\" Intervall einzustellen\nStellen Sie elektrische Daten als Zustände zur Verfügung (Arrays für jetzt)\nWiederherstellen der letzten Daten aktualisiert Zeitstempel\nStellen Sie sicher, dass cloudConnection immer ein boolean enthält\nRefresh-Token auch, wenn Fehler \"Refresh Token ist abgelaufen\"",
        "ru": "ВАЖНО: Минимальная версия Node.js 18.2\nBREAKING: Настроен на новый Daiking Cloud API - вам нужно обновить!\nBREAKING: Новый лимит курса нового API составляет 200 запросов в день! Настройте свое использование!\nДобавлена опция для установки интервала \"медленный опрос\"\nСделайте электрические данные доступными в виде состояний (предъявления на данный момент)\nВосстановление последних данных\nУбедитесь, что CloudConnection всегда содержит булеан\nПовторите также, когда ошибка «Refresh Token истекла»",
        "pt": "IMPORTANTE: A versão mínima do Node.js é 18.2\nBREAKING: Ajustado a nova API Daiking Cloud - Você precisa reauthenticar!\nBREAKING: Novo limite de taxa de nova API é 200 pedidos por dia!! Ajuste seu uso!\nOpção adicionada para definir o intervalo de \"slow polling\"\nFaça dados elétricos disponíveis como estados (arrays por agora)\nRestaurar os últimos dados atualizados timestamp\nCertifique-se de cloudConnection sempre contém um booleano\nAtualizar token também quando o erro é \"Refresh Token expirou\"",
        "nl": "BELANGRIJK: Minimale Node.js versie is 18,2\nAangepast aan de nieuwe Daiking Cloud API - Je moet herauthenticeren!\nBreaking: Nieuwe tarieflimiet van nieuwe API is 200 verzoeken per dag!! Pas uw gebruik aan!\nToegevoegde optie om \"langzame polling\" interval in te stellen\nElektrische gegevens beschikbaar stellen als states (arrays voor nu)\nLaatste bijgewerkte tijdstempel van gegevens herstellen\nZorg ervoor dat cloudConnection altijd een boolean bevat\nVernieuw token ook wanneer fout is \"Vernieuwen Token is verlopen\"",
        "fr": "IMPORTANT: La version minimum Node.js est 18.2\nBREAKING: Ajusté à la nouvelle API Daiking Cloud - Vous devez reauthenticate!\nBREAKING: Nouvelle limite de taux de nouvelle API est 200 demandes par jour!! Ajustez votre utilisation !\nAjout de l'option pour définir l'intervalle de \"slow scruting\"\nMettre les données électriques à disposition dans les états (pour le moment)\nRestaurer les dernières données mises à jour timestamp\nAssurez-vous que CloudConnection contient toujours un booléen\nRefresh token aussi quand l'erreur est \"Reresh Token a expiré\"",
        "it": "IMPORTANTE: Versione minima Node.js è 18.2\nBREAKING: Regolato alla nuova Daiking Cloud API - È necessario ripristinare!\nBREAKING: Il nuovo limite di velocità delle nuove API è di 200 richieste al giorno!! Regolare il vostro utilizzo!\nAggiunta opzione per impostare \"slow polling\" intervallo\nRendere i dati elettrici disponibili come stati (arrays per ora)\nRipristinare gli ultimi dati aggiornato timestamp\nAssicurati che cloudConnection contenga sempre un booleano\nToken di aggiornamento anche quando l'errore è \"Refresh Token è scaduto\"",
        "es": "IMPORTANTE: versión mínima Node.js es 18.2\nBREAKING: Ajustado a la nueva API de Daiking Cloud - ¡Necesita volver a autenticar!\nBREAKING: ¡El nuevo límite de tarifas de la nueva API es de 200 solicitudes por día! ¡Ajusta tu uso!\nOpción agregada para establecer intervalo de \"slow polling\"\nPoner datos eléctricos disponibles como estados (arrayas por ahora)\nRestaurar los últimos datos actualizados\nAsegúrese de que la nubeConnection siempre contiene un booleano\nRefresh token también cuando el error es \"Refresh Token ha expirado\"",
        "pl": "WAŻNE: Minimalna wersja Node.js to 18.2\nBREAKING: Dostosowana do nowego Daiking Cloud API - Musisz ponownie uwierzytelnić!\nBREAKING: Nowy limit stawki nowego API wynosi 200 wniosków dziennie!! Dostosuj swoje użycie!\nDodano opcję ustawiania przerwy \"powolne sondaże\"\nUdostępnij dane elektryczne jako stany (tablice na razie)\nPrzywróć ostatni zaktualizowany znacznik czasu\nUpewnij się, że CloudConnection zawsze zawiera boolean\nOdśwież token również, gdy błąd jest \"Odśwież Token wygasł\"",
        "uk": "Імпортант: Мінімальна версія Node.js 18.2\nBREAKING: Налаштовано новий API Daiking Cloud - Вам потрібно переоцінити!\nBREAKING: Новий ліміт курсу нового API становить 200 запитів на день! Налаштування вашого використання!\nДодано опцію для встановлення інтервалу «повільне опитування»\nЗробіть електричні дані, доступні як штати (для цього)\nВідновити останні дані оновлений час\nПереконайтеся, що хмарнийConnection завжди містить булеван\nВідновити токен також при похибці \"Повідомлення Token\"",
        "zh-cn": "重要:最小节点.js版本为18.2\n适应了新的戴京云API - 你需要重新认证!\n新API的新费率限制是每天200个请求! 调整你的用法!\n设置“ 慢投票” 间隔的选项\n提供状态的电气数据(目前为阵列)\n恢复上次更新的时间戳数据\n确保云串总是包含布尔\n当错误是“ 更新托肯已过期 ” 时也刷新符号"
      },
      "0.3.0": {
        "en": "Make compatible with Node.js 18+ too\nAdjust name fallback",
        "de": "Kompatibel mit Node.js 18+ machen\nAdjust name fallback",
        "ru": "Сделайте совместимость с Node.js 18+ слишком\nОтрегулируйте имя fallback",
        "pt": "Faça compatível com Node.js 18+ também\nAjuste o nome fallback",
        "nl": "Maak het ook goed met Node\nVertaling:",
        "fr": "Make compatible with Node.js 18+ too\nAjuster le nom",
        "it": "Rendere compatibile anche con Node.js 18+\nRegolare il nome fallback",
        "es": "Hacer compatible con Node.js 18+ también\nRetroceder de nombre ajustado",
        "pl": "Jest kompatybilny z Node.js 18+\nAdjust name fallback (ang.)",
        "uk": "Використовуйте сумісний з Node.js 18+ занадто\nРегулювання назви",
        "zh-cn": "与第18+号不相容\n独立名称"
      },
      "0.2.3": {
        "en": "Clear the tokenset when email or password is changed in config",
        "de": "Löschen Sie den Tokenset, wenn E-Mail oder Passwort in config geändert wird",
        "ru": "Очистить токены, когда электронная почта или пароль изменены в config",
        "pt": "Limpar o tokenset quando e-mail ou senha é alterado em config",
        "nl": "Ontruim het tokenet als e-mail of wachtwoord veranderd is",
        "fr": "Effacer le bouton lorsque l'email ou le mot de passe est modifié dans la configuration",
        "it": "Cancellare il tokenset quando l'email o la password viene modificata in configurazione",
        "es": "Despejar el tokenset cuando el correo electrónico o la contraseña se cambia en config",
        "pl": "Wyraźny symbol, gdy e-mail lub hasło zmienia się w konfiguście",
        "zh-cn": "当电子邮件或密码发生变化时,明示点",
        "uk": "Очищайте набір токенів, коли електронну адресу чи пароль змінено в конфігурації"
      },
      "0.2.2": {
        "en": "Add naming support for devices using old WLAN adapters but updated for Onecta",
        "de": "Hinzufügen von Namensunterstützung für Geräte mit alten WLAN-Adaptern, aber aktualisiert für Onecta",
        "ru": "Добавьте поддержку для устройств с использованием старых адаптеров WLAN, но обновлен для Onecta",
        "pt": "Adicionar suporte de nome para dispositivos usando adaptadores WLAN antigos, mas atualizado para Onecta",
        "nl": "Vermelden voor apparatuur met gebruik van oude WLAN adapters maar update voor Onecta",
        "fr": "Ajouter le support de dénomination pour les appareils utilisant les anciens adaptateurs WLAN mais mis à jour pour Onecta",
        "it": "Aggiungi supporto per i nomi per i dispositivi che utilizzano vecchi adattatori WLAN ma aggiornati per Onecta",
        "es": "Añadir soporte para nombres de dispositivos con adaptadores WLAN antiguos pero actualizado para Onecta",
        "pl": "Addd naming support dla urządzeń korzystających ze starych adapterów WLAN, ale aktualizował dla Onecta",
        "zh-cn": "增加使用旧的WLAN适应器对装置的命名支助,但对单一气体的更新",
        "uk": "Додайте підтримку імен для пристроїв, які використовують старі адаптери WLAN, але оновлені для Onecta"
      },
      "0.2.1": {
        "en": "Fix the device info and count for connected devices in Admin UI",
        "de": "Festlegen der Geräte-Info und Zählung für angeschlossene Geräte in Admin UI",
        "ru": "Исправьте информацию о устройстве и рассчитывайте на подключенные устройства в Admin UI",
        "pt": "Corrigir a informação do dispositivo e contar para dispositivos conectados na interface do administrador",
        "nl": "Repareer het apparaat info en tel op verbonden apparatuur in Admin UI",
        "fr": "Fixer les informations de l'appareil et compter pour les appareils connectés dans Admin UI",
        "it": "Fissare le informazioni del dispositivo e contare per i dispositivi collegati in Admin UI",
        "es": "Fijar la información del dispositivo y contar para dispositivos conectados en Admin UI",
        "pl": "Fix info i count dla urządzeń połączonych w Admin UI",
        "zh-cn": "Fix 在阿德明·乌伊内设计和计算相关装置的装置",
        "uk": "Виправте інформацію про пристрій і кількість підключених пристроїв в інтерфейсі адміністратора"
      },
      "0.2.0": {
        "en": "Add name lookup for Altherma devices\nSend data to Sentry on unknown device types",
        "de": "Name Lookup für Altherma-Geräte hinzufügen\nDaten an Sentry über unbekannte Gerätetypen senden",
        "ru": "Добавьте имя для устройств Altherma\nОтправьте данные в Sentry на неизвестные типы устройств",
        "pt": "Adicionar pesquisa de nome para dispositivos Altherma\nEnviar dados para Sentry em tipos de dispositivos desconhecidos",
        "nl": "Voeg de naam op voor Altherma apparatuur\nStuur gegevens naar Sentry op onbekende apparaten",
        "fr": "Ajouter le lookup de nom pour les appareils Altherma\nEnvoyer des données à Sentry sur des types de périphériques inconnus",
        "it": "Aggiungi ricerca nome per dispositivi Altherma\nInvia i dati a Sentry su tipi di dispositivo sconosciuti",
        "es": "Agregar nombre de búsqueda para dispositivos Altherma\nEnviar datos a Sentry en tipos de dispositivo desconocidos",
        "pl": "Addd – nazwa urządzeń Altherma\nDane dotyczące wjazdu na nieznane typy urządzeń",
        "zh-cn": "圣诞节装置的名称调查\n未知装置类型的数据",
        "uk": "Додайте пошук імен для пристроїв Altherma\nНадсилати дані до Sentry на пристрої невідомого типу"
      },
      "0.1.4": {
        "en": "Adjust logging on Login to be more clear",
        "de": "Loggen Sie sich auf Login ein, um deutlicher zu sein",
        "ru": "Отрегулируйте вход в систему, чтобы быть более ясным",
        "pt": "Ajuste o login para ser mais claro",
        "nl": "Aanpassen op Login om duidelijker te zijn",
        "fr": "Ajuster la connexion sur Login pour être plus clair",
        "it": "Regolare la registrazione su Login per essere più chiaro",
        "es": "Ajuste el registro en Iniciar sesión para ser más claro",
        "pl": "Adjust logowanie na Loginie jest bardziej jasne",
        "zh-cn": "更清楚的逻辑调整",
        "uk": "Налаштуйте вхід у систему, щоб було зрозуміліше"
      }
    },
    "title": "Daikin Cloud",
    "titleLang": {
      "en": "Daikin Cloud",
      "de": "Daikin Cloud",
      "ru": "Daikin Cloud",
      "pt": "Daikin Cloud",
      "nl": "Daikin Cloud",
      "fr": "Daikin Cloud",
      "it": "Daikin Cloud",
      "es": "Nube Daikin",
      "pl": "Chmura Daikin",
      "zh-cn": "大金云",
      "uk": "Daikin Cloud"
    },
    "desc": {
      "en": "Control Daikin Devices that are only connected to the Daikin Cloud",
      "de": "Steuern Sie Daikin-Geräte, die nur mit der Daikin-Cloud verbunden sind",
      "ru": "Управление устройствами Daikin, подключенными только к Daikin Cloud",
      "pt": "Controlar dispositivos Daikin que estão conectados apenas à nuvem Daikin",
      "nl": "Beheer Daikin-apparaten die alleen met de Daikin Cloud zijn verbonden",
      "fr": "Contrôlez les appareils Daikin qui sont uniquement connectés au Daikin Cloud",
      "it": "Controlla i dispositivi Daikin che sono collegati solo a Daikin Cloud",
      "es": "Controle los dispositivos Daikin que solo están conectados a Daikin Cloud",
      "pl": "Kontroluj urządzenia Daikin, które są podłączone tylko do chmury Daikin",
      "zh-cn": "控制仅连接到大金云的大金设备",
      "uk": "Керуйте пристроями Daikin, які підключені лише до Daikin Cloud"
    },
    "authors": [
      "Apollon77 <iobroker@fischer-ka.de>"
    ],
    "keywords": [
      "Daikin",
      "Daikin Cloud"
    ],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "daikin-cloud.jpg",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/Apollon77/ioBroker.daikin-cloud/master/admin/daikin-cloud.jpg",
    "readme": "https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "climate-control",
    "compact": true,
    "messagebox": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "tier": 2,
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=6.2.13"
      }
    ],
    "plugins": {
      "sentry": {
        "dsn": "https://3ac7b6d04c3e4faf8c0bfe0cd38396a6@sentry.iobroker.net/197",
        "pathWhitelist": [
          "@apollon",
          "daikin-controller-cloud"
        ]
      }
    }
  },
  "encryptedNative": [
    "clientId",
    "clientSecret"
  ],
  "protectedNative": [
    "clientId",
    "clientSecret"
  ],
  "native": {
    "clientId": "",
    "clientSecret": "",
    "pollingInterval": 900,
    "slowPollingInterval": 1800
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    },
    {
      "_id": "info.rateLimitMinute",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Rate Limit per minute",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateRemainingMinute",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Remaining rate Limit per minute",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateLimitDay",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Rate Limit per day",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "info.rateRemainingDay",
      "type": "state",
      "common": {
        "role": "value",
        "name": "Remaining rate Limit per day",
        "type": "number",
        "read": true,
        "write": false
      },
      "native": {}
    },
    {
      "_id": "_config",
      "type": "config",
      "common": {
        "name": "Token data for Daikin Onecta cloud",
        "expert": true
      },
      "native": {
        "tokenSet": null
      }
    },
    {
      "_id": "useSlowPolling",
      "type": "state",
      "common": {
        "role": "switch",
        "name": "Use Slow polling interval for e.g night times",
        "type": "boolean",
        "read": true,
        "write": true,
        "def": false
      },
      "native": {}
    }
  ]
}
