{
    "DiscoveredInfo": "Succes! %s apparaten ontdekt in het verbonden cloudaccount! Proxy wordt over 15 seconden uitgeschakeld",
    "E-Mail": "E-mail",
    "EmailPassword": "Log in met e-mail en wachtwoord",
    "Password": "Wachtwoord",
    "Polling Interval": "Polling-interval (als apparaat niet met app was gesynchroniseerd)",
    "Proxy": "Alternatief: Inloggen via Proxy",
    "Proxy External IP": "Proxy Extern IP (optioneel, gebruik voor Docker)",
    "Proxy Port": "Proxypoort",
    "Proxy Web Info Port": "Proxy SSL-Zertifikat-poort",
    "Proxy-Info": "Om uw Daikin-apparaten die zijn verbonden met uw Daikin Cloud-account en de Onecta-app te kunnen zien en bedienen, moet u deze adapter eenmalig verbinden met uw cloudaccount. Dit gebeurt via <b>e-mail en wachtwoord</b> of door gebruik te maken van de <b>Adapter Web-Proxy</b> in uw WLAN-verbinding samen met een SSL-certificaat.<br/><br/> Als u een login-fout krijgt bij het gebruik van e-mail en wachtwoord dat een Captcha moet worden opgelost, volg dan de instructies op de <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md\" target=\"_blank\">README-pagina</a> .<br/><br/> Meer informatie over het gebruik van de Proxy is te vinden op de <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/PROXY.md\" target=\"_blank\">PROXY-pagina</a><br/><br/> Start de proxy met de knop aan de rechterkant en volg de aanvullende instructies.",
    "ProxyInfoText": "Als je een tweede poging nodig hebt, zorg er dan voor dat je de aanvankelijk weergegeven pagina een keer opnieuw laadt, anders zal het proces mislukken!",
    "ProxySteps": "Klik op de QR-code om het proxyproces op deze computer te starten of scan de QR-code met uw mobiele telefoon.",
    "Start proxy": "Start proxy (wees geduldig, kan enkele seconden duren!)",
    "StatusInfo": "Status: %s apparaten gevonden in verbonden cloudaccount, %s apparaten zijn online",
    "Stop proxy": "Stop proxy",
    "daikin-cloud adapter settings": "Adapterinstellingen voor daikin-cloud"
}
