{
    "auth_header": "Authenticatieproces met Daikin Cloud-instructies",
    "auth_link": "Meld u aan op het Daikin Europe Developer Portal",
    "auth_step1": "1. Zorg ervoor dat uw beheerdersinstantie die u gebruikt voor de volgende authenticatie <b>HTTPS heeft ingeschakeld!</b> als dit niet het geval is, gebruik dan een tweede beheerdersinstantie!",
    "auth_step2": "2. Meld u aan voor een Daikin-ontwikkelaarsaccount en voeg daar één \"App\" toe om een ​​klant-ID en klantgeheim te krijgen. Voor deze aanmeldingsstap kunt u het veld 'Omleidings-URL' leeg laten.",
    "auth_step3": "3. Voer de klant-ID en het geheim in de onderstaande velden in.",
    "auth_step4": "4. Druk op deze knop om de omleidings-URL te krijgen... (Negeer de kop 'Fout' van de pop-up)",
    "auth_step5": "5. Bewerk de app in de Daikin Developer Portal en voeg de omleidings-URL toe die u in de vorige stap kreeg!",
    "auth_step6": "6. Druk op de volgende knop om u te authenticeren bij de Daikin Cloud in een nieuw venster/tabblad. Als het venster niet wordt geopend, <b>controleer dan uw pop-upblokkeringsinstellingen om pop-ups toe te staan</b>!",
    "auth_step7": "7. Authenticeer bij Daikin Cloud",
    "auth_step8": "8. Na de succesvolle authenticatie en nadat u de succespagina in het andere venster hebt gezien, slaat u de instellingen op en drukt u op de knop \"Opslaan en sluiten\" hieronder!",
    "polling_header": "Intervallen voor het opvragen van gegevens",
    "polling_info": "De Daikin-cloud introduceert tariefbeperkingen voor de API. De hoofdlimiet is <b>maximaal 200 verzoeken per dag</b>! Gebruik de langzame polling in tijden waarin er niet vaak updates nodig zijn. Stel de status <b>useSlowPolling</b> in op true om het langzame polling-interval te gebruiken! De meest recente informatie over de tarieflimieten vindt u in de info.*-staten.",
    "polling_interval": "Interval gegevensopvragen (seconden)",
    "polling_interval_slow": "Langzaam opvragen van gegevens Interval (seconden)",
    "same_value_header": "Welke waarden moeten naar Daikin worden gestuurd?",
    "same_value_info": "Om de interacties met de Daikin-cloud zo goed mogelijk te beperken, kunt u hier definiëren welke waarden naar de Daikin-cloud moeten worden verzonden.",
    "sendSameValue": "Dezelfde waarden opnieuw verzenden?"
}
