{
    "auth_header": "Authentifizierungsprozess mit Daikin Cloud Informationen",
    "auth_link": "Daikin Europe Developer Portal Anmeldung/Login",
    "auth_step1": "1. Die Admin-Instanz, die für die folgende Authentifizierung verwendet wird, muss <b>HTTPS aktiviert haben!</b> Wenn nicht, kann eine zweite Admin-Instanz verwendet werden!",
    "auth_step2": "2. Nach der Erstellung eines Daikin-Entwicklerkontos bitte dort eine „App“ hinzufügen, um eine Client-ID und ein Client-Secret zu erhalten. Das Feld „Redirect URL“ kann für diesen Anmeldeschritt leer gelassen werden.",
    "auth_step3": "3. Bitte Client-ID und Client-Secret in die Felder unten eintragen.",
    "auth_step4": "4. Klicken um Redirect-URL zu erhalten ... (Überschrift „Fehler“ im Popup ignorieren)",
    "auth_step5": "5. Redirect-URL aus dem vorherigen Schritt in die App im Daikin Developer Portal eintragen!",
    "auth_step6": "6. Folgende Schaltfläche klicken, um sich in einem neuen Fenster/Tab bei der Daikin Cloud zu authentifizieren. Wenn sich das Fenster nicht öffnet, <b>bitte die Popup-Blocker-Einstellungen überprüfen, um Popups zuzulassen</b>!",
    "auth_step7": "7. Bei Daikin Cloud einloggen und Zugriff bestätigen.",
    "auth_step8": "8. Nach erfolgreicher Authentifizierung und nachdem die Erfolgsseite im anderen Fenster angezeigt wurde, die Einstellungen bitte speichern und unten auf die Schaltfläche „Speichern und schließen“ klicken!",
    "polling_header": "Datenabfrageintervalle",
    "polling_info": "Die Daikin-Cloud führt Ratenbeschränkungen für die API ein. Das Hauptlimit liegt bei <b>maximal 200 Anfragen pro Tag</b>! Nutzen Sie die langsame Abfrage in Zeiten, in denen keine häufigen Updates erforderlich sind. Bitte setzen Sie den Status <b>useSlowPolling</b> auf true, um das langsame Abfrageintervall zu verwenden! Die neuesten Details zur Ratenbegrenzung finden Sie in den info.*-States.",
    "polling_interval": "Datenabfrageintervall",
    "polling_interval_slow": "Langsames Datenabfrageintervall"
}
