{
    "auth_header": "Процес автентифікації за допомогою інструкцій Daikin Cloud",
    "auth_link": "Зареєструйтеся на порталі розробників Daikin Europe",
    "auth_step1": "1. Переконайтеся, що у вашому екземплярі адміністратора, який ви використовуєте для наступної автентифікації, <b>увімкнено HTTPS!</b> Якщо ні, скористайтеся другим екземпляром адміністратора!",
    "auth_step2": "2. Зареєструйтеся в обліковому записі розробника Daikin і додайте туди одну «програму», щоб отримати ідентифікатор клієнта та секрет клієнта. Ви можете залишити поле «URL-адреса перенаправлення» пустим для цього кроку реєстрації.",
    "auth_step3": "3. Введіть ідентифікатор клієнта та секрет у поля нижче.",
    "auth_step4": "4. Натисніть цю кнопку, щоб отримати URL-адресу перенаправлення ... (Ігноруйте заголовок «Помилка» у спливаючому вікні)",
    "auth_step5": "5. Відредагуйте програму на порталі розробників Daikin і додайте URL-адресу перенаправлення, яку ви отримали на попередньому кроці!",
    "auth_step6": "6. Натисніть наступну кнопку, щоб пройти автентифікацію за допомогою Daikin Cloud у новому вікні/вкладці. Якщо вікно не відкривається, <b>перевірте налаштування блокувальника спливаючих вікон, щоб дозволити спливаючі вікна</b>!",
    "auth_step7": "7. Пройдіть автентифікацію за допомогою Daikin Cloud",
    "auth_step8": "8. Після успішної автентифікації та після того, як ви побачите сторінку успіху в іншому вікні, збережіть налаштування та натисніть кнопку «Зберегти та закрити» нижче!",
    "polling_header": "Інтервали опитування даних",
    "polling_info": "Хмара Daikin вводить обмеження швидкості для API. Основним обмеженням є <b>максимум 200 запитів на день</b>! Використовуйте повільне опитування в тих випадках, коли не потрібні часті оновлення. Будь ласка, встановіть для стану <b>useSlowPolling</b> значення true, щоб використовувати повільний інтервал опитування! Останні відомості про обмеження швидкості можна знайти в розділі info.* states.",
    "polling_interval": "Інтервал опитування даних (секунди)",
    "polling_interval_slow": "Повільний інтервал опитування даних (секунди)",
    "same_value_header": "Які значення надсилати в Daikin?",
    "same_value_info": "Щоб максимально скоротити взаємодію з хмарою Daikin, тут можна визначити, які значення потрібно надсилати в хмару Daikin.",
    "sendSameValue": "Знову надіслати ті самі значення?"
}
