{
    "DiscoveredInfo": "Powodzenie! %s urządzeń wykrytych na połączonym koncie w chmurze! Serwer proxy zostanie wyłączony za 15 sekund",
    "E-Mail": "E-mail",
    "EmailPassword": "Zaloguj się za pomocą e-maila i hasła",
    "Password": "Hasło",
    "Polling Interval": "Interwał odpytywania (jeśli urządzenie nie było zsynchronizowane z aplikacją)",
    "Proxy": "Alternatywnie: Zaloguj się przez Proxy",
    "Proxy External IP": "Zewnętrzny adres IP proxy (opcjonalnie, użyj dla Dockera)",
    "Proxy Port": "Port proxy",
    "Proxy Web Info Port": "Port proxy SSL-Zertifikat Port",
    "Proxy-Info": "Aby móc zobaczyć i sterować urządzeniami Daikin, które są połączone z kontem Daikin Cloud i aplikacją Onecta, należy raz połączyć ten adapter z kontem w chmurze. Odbywa się to za pomocą <b>poczty e-mail i hasła</b> lub przy użyciu <b>adaptera Web-Proxy</b> w połączeniu WLAN wraz z certyfikatem SSL.<br/><br/> Jeśli pojawi się błąd logowania podczas używania poczty e-mail i hasła, że Captcha musi zostać rozwiązany, postępuj zgodnie z instrukcjami na stronie <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md\" target=\"_blank\">README</a> .<br/><br/> Więcej informacji na temat korzystania z Proxy można znaleźć na stronie <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/PROXY.md\" target=\"_blank\">PROXY</a><br/><br/> Uruchom proxy przyciskiem po prawej stronie i postępuj zgodnie z dodatkowymi instrukcjami.",
    "ProxyInfoText": "Jeśli potrzebujesz drugiej próby, pamiętaj o ponownym załadowaniu początkowej wyświetlanej strony w dowolnym momencie, w przeciwnym razie proces się nie powiedzie!",
    "ProxySteps": "Kliknij kod QR, aby rozpocząć proces proxy na tym komputerze lub zeskanuj kod QR telefonem komórkowym.",
    "Start proxy": "Uruchom proxy (bądź cierpliwy, może zająć kilka sekund!)",
    "StatusInfo": "Status: %s urządzeń znalezionych na połączonym koncie w chmurze, %s urządzeń jest online",
    "Stop proxy": "Zatrzymaj proxy",
    "daikin-cloud adapter settings": "Ustawienia adaptera dla daikin-cloud"
}
