{
    "DiscoveredInfo": "Успех! В подключенной облачной учетной записи обнаружено %s устройств! Прокси будет отключен через 15 секунд",
    "E-Mail": "Электронная почта",
    "EmailPassword": "Войти с помощью электронной почты и пароля",
    "Password": "Пароль",
    "Polling Interval": "Интервал опроса (если устройство не синхронизировалось с приложением)",
    "Proxy": "Альтернатива: Вход через прокси",
    "Proxy External IP": "Внешний IP-адрес прокси (необязательно, используйте для Docker)",
    "Proxy Port": "Порт прокси",
    "Proxy Web Info Port": "Прокси SSL-Порт Зертификата",
    "Proxy-Info": "Чтобы иметь возможность видеть и контролировать свои устройства Daikin, подключенные к вашей учетной записи Daikin Cloud и приложению Onecta, вам необходимо один раз подключить этот адаптер к вашей облачной учетной записи. Это делается либо с помощью <b>электронной почты и пароля</b> , либо с помощью <b>адаптера веб-прокси</b> в вашем WLAN-соединении вместе с сертификатом SSL.<br/><br/> Если при использовании электронной почты и пароля вы получаете сообщение об ошибке входа в систему, которое необходимо решить с помощью Captcha, следуйте инструкциям на <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md\" target=\"_blank\">странице README</a> .<br/><br/> Более подробную информацию об использовании прокси можно найти на <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/PROXY.md\" target=\"_blank\">странице PROXY</a> .<br/><br/> Запустите прокси кнопкой справа и следуйте дополнительным инструкциям.",
    "ProxyInfoText": "Если вам нужна вторая попытка, обязательно перезагрузите первоначальную отображаемую страницу в любое время один раз, иначе процесс завершится ошибкой!",
    "ProxySteps": "Нажмите на QR-код, чтобы запустить процесс прокси на этом компьютере, или отсканируйте QR-код с помощью мобильного телефона.",
    "Start proxy": "Запустите прокси (будьте терпеливы, может занять несколько секунд!)",
    "StatusInfo": "Статус: %s устройств найдено в подключенной облачной учетной записи, %s устройств подключены к сети",
    "Stop proxy": "Остановить прокси",
    "daikin-cloud adapter settings": "Настройки адаптера для daikin-cloud"
}
