{
    "auth_header": "Процесс аутентификации с помощью инструкций Daikin Cloud",
    "auth_link": "Зарегистрируйтесь на портале разработчиков Daikin Europe.",
    "auth_step1": "1. Убедитесь, что ваш экземпляр администратора, который вы используете для следующей аутентификации, <b>включен HTTPS!</b>, если нет, используйте второй экземпляр администратора!",
    "auth_step2": "2. Зарегистрируйте учетную запись разработчика Daikin и добавьте туда одно «приложение», чтобы получить идентификатор клиента и секрет клиента. На этом этапе регистрации вы можете оставить поле «URL-адрес перенаправления» пустым.",
    "auth_step3": "3. Введите идентификатор клиента и секретный код в поля ниже.",
    "auth_step4": "4. Нажмите эту кнопку, чтобы получить URL-адрес перенаправления... (игнорируйте заголовок «Ошибка» во всплывающем окне)",
    "auth_step5": "5. Отредактируйте приложение на портале разработчиков Daikin и добавьте URL-адрес перенаправления, полученный на предыдущем шаге!",
    "auth_step6": "6. Нажмите следующую кнопку для аутентификации в Daikin Cloud в новом окне/вкладке. Если окно не открывается, <b>проверьте настройки блокировки всплывающих окон, чтобы разрешить всплывающие окна</b>!",
    "auth_step7": "7. Аутентификация с помощью Daikin Cloud",
    "auth_step8": "8. После успешной аутентификации и просмотра страницы успеха в другом окне сохраните настройки и нажмите кнопку «Сохранить и закрыть» ниже!",
    "polling_header": "Интервалы опроса данных",
    "polling_info": "Облако Daikin вводит ограничения по скорости для API. Основной лимит — <b>максимум 200 запросов в день</b>! Используйте медленный опрос в тех случаях, когда не требуются частые обновления. Установите для состояния <b>useSlowPolling</b> значение true, чтобы использовать медленный интервал опроса! Актуальную информацию об ограничении скорости можно найти в разделе info.*.",
    "polling_interval": "Интервал опроса данных (секунды)",
    "polling_interval_slow": "Интервал медленного опроса данных (секунды)",
    "same_value_header": "Какие значения отправлять в Daikin?",
    "same_value_info": "Чтобы максимально сократить взаимодействие с облаком Daikin, вы можете определить здесь, какие значения следует отправлять в облако Daikin.",
    "sendSameValue": "Отправить те же значения еще раз?"
}
