{
    "auth_header": "Processo de autenticação com instruções do Daikin Cloud",
    "auth_link": "Inscreva-se no Daikin Europe Developer Portal",
    "auth_step1": "1. Certifique-se de que sua instância de administrador usada para a seguinte autenticação <b>tem HTTPS ativado!</b> caso contrário, use uma segunda instância de administrador!",
    "auth_step2": "2. Inscreva-se em uma conta de desenvolvedor Daikin e adicione um \"aplicativo\" para obter um ID de cliente e um segredo de cliente. Você pode deixar o campo \"URL de redirecionamento\" vazio para esta etapa de inscrição.",
    "auth_step3": "3. Insira o ID do cliente e o segredo nos campos abaixo.",
    "auth_step4": "4. Pressione este botão para obter o URL de redirecionamento ... (Ignorar o título 'Erro' do pop-up)",
    "auth_step5": "5. Edite o aplicativo no Daikin Developer Portal e adicione o URL de redirecionamento obtido na etapa anterior!",
    "auth_step6": "6. Pressione o botão seguinte para autenticar com o Daikin Cloud numa nova janela/separador. Se a janela não abrir, <b>verifique as configurações do bloqueador de pop-ups para permitir pop-ups</b>!",
    "auth_step7": "7. Autenticar com Daikin Cloud",
    "auth_step8": "8. Após a autenticação bem-sucedida e depois de ver a página de sucesso na outra janela, salve as configurações e pressione o botão \"Salvar e Fechar\" abaixo!",
    "polling_header": "Intervalos de pesquisa de dados",
    "polling_info": "A nuvem Daikin introduz limitações de taxa para a API. O limite principal é <b>máximo de 200 solicitações por dia</b>! Use a pesquisa lenta em momentos em que não são necessárias atualizações frequentes. Defina o estado <b>useSlowPolling</b> como true para usar o intervalo de pesquisa lento! Os detalhes mais recentes sobre limites de taxa podem ser encontrados nos estados info.*.",
    "polling_interval": "Intervalo de pesquisa de dados (segundos)",
    "polling_interval_slow": "Intervalo lento de pesquisa de dados (segundos)",
    "same_value_header": "Quais valores enviar para a Daikin?",
    "same_value_info": "Para reduzir ao máximo as interações com a nuvem Daikin, pode definir aqui quais os valores que devem ser enviados para a nuvem Daikin.",
    "sendSameValue": "Enviar os mesmos valores novamente?"
}
