{
    "DiscoveredInfo": "Successo! %s dispositivi rilevati nell'account cloud connesso! Il proxy verrà disattivato tra 15 secondi",
    "E-Mail": "E-mail",
    "EmailPassword": "Accedi con E-Mail e Password",
    "Password": "Parola d'ordine",
    "Polling Interval": "Intervallo di polling (se il dispositivo non è stato sincronizzato con l'app)",
    "Proxy": "Alternativa: accesso tramite proxy",
    "Proxy External IP": "IP esterno proxy (opzionale, da utilizzare per Docker)",
    "Proxy Port": "Porta proxy",
    "Proxy Web Info Port": "Porta proxy SSL-Zertifikat",
    "Proxy-Info": "Per poter vedere e controllare i tuoi dispositivi Daikin collegati al tuo account Daikin Cloud e all'app Onecta, devi collegare questo adattatore al tuo account cloud una volta. Questo viene fatto tramite <b>e-mail e password</b> o utilizzando l' <b>adattatore Web-proxy</b> nella connessione WLAN insieme a un certificato SSL.<br/><br/> Se viene visualizzato un errore di accesso quando si utilizza l'e-mail e la password per risolvere un Captcha, seguire le istruzioni nella <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/README.md\" target=\"_blank\">pagina README</a> .<br/><br/> Maggiori informazioni sull'utilizzo del Proxy sono disponibili nella <a href=\"https://github.com/Apollon77/ioBroker.daikin-cloud/blob/master/PROXY.md\" target=\"_blank\">pagina PROXY</a><br/><br/> Avvia il proxy con il pulsante a destra e segui le istruzioni aggiuntive.",
    "ProxyInfoText": "Se hai bisogno di un secondo tentativo, assicurati di ricaricare la pagina iniziale visualizzata in qualsiasi momento, altrimenti il processo fallirà!",
    "ProxySteps": "Clicca sul QR-Code per avviare il processo proxy su questo computer o scansiona il QR-Code con il tuo cellulare.",
    "Start proxy": "Avvia proxy (sii paziente, può richiedere alcuni secondi!)",
    "StatusInfo": "Stato: %s dispositivi trovati nell'account cloud connesso, %s dispositivi sono online",
    "Stop proxy": "Stop proxy",
    "daikin-cloud adapter settings": "Impostazioni dell'adattatore per daikin-cloud"
}
