{
    "auth_header": "Processo di autenticazione con istruzioni Daikin Cloud",
    "auth_link": "Iscriviti al portale per sviluppatori Daikin Europe",
    "auth_step1": "1. Assicurati che l'istanza di amministrazione che utilizzi per la seguente autenticazione <b>abbia HTTPS abilitato!</b> in caso contrario, utilizza una seconda istanza di amministrazione!",
    "auth_step2": "2. Registrarsi per un account sviluppatore Daikin e aggiungere una \"App\" per ottenere un ID cliente e un segreto cliente. Puoi lasciare vuoto il campo \"URL di reindirizzamento\" per questo passaggio di registrazione.",
    "auth_step3": "3. Inserisci l'ID cliente e il segreto nei campi sottostanti.",
    "auth_step4": "4. Premi questo pulsante per ottenere l'URL di reindirizzamento... (Ignora il titolo \"Errore\" del popup)",
    "auth_step5": "5. Modifica l'app nel Portale per sviluppatori Daikin e aggiungi l'URL di reindirizzamento ottenuto nel passaggio precedente!",
    "auth_step6": "6. Premere il pulsante seguente per autenticarsi con Daikin Cloud in una nuova finestra/scheda. Se la finestra non si apre, <b>controlla le impostazioni del blocco popup per consentire i popup</b>!",
    "auth_step7": "7. Autenticarsi con Daikin Cloud",
    "auth_step8": "8. Dopo l'autenticazione riuscita e dopo aver visto la pagina di successo nell'altra finestra, salva le impostazioni e premi il pulsante \"Salva e chiudi\" qui sotto!",
    "polling_header": "Intervalli di polling dei dati",
    "polling_info": "Il cloud Daikin introduce limitazioni di velocità per l'API. Il limite principale è <b>massimo 200 richieste al giorno</b>! Utilizzare il polling lento nei momenti in cui non sono necessari aggiornamenti frequenti. Imposta lo stato <b>useSlowPolling</b> su true per utilizzare l'intervallo di polling lento! I dettagli più recenti sulla limitazione della tariffa possono essere trovati negli stati info.*.",
    "polling_interval": "Intervallo di polling dei dati (secondi)",
    "polling_interval_slow": "Intervallo di polling dati lento (secondi)",
    "same_value_header": "Quali valori inviare a Daikin?",
    "same_value_info": "Per ridurre al meglio le interazioni con il cloud Daikin, è possibile definire qui quali valori devono essere inviati al cloud Daikin.",
    "sendSameValue": "Inviare di nuovo gli stessi valori?"
}
