{
    "auth_header": "Processus d'authentification avec les instructions Daikin Cloud",
    "auth_link": "Inscrivez-vous sur le portail des développeurs Daikin Europe",
    "auth_step1": "1. Assurez-vous que votre instance d'administrateur que vous utilisez pour l'authentification suivante <b>a HTTPS activé !</b> sinon, veuillez utiliser une deuxième instance d'administrateur !",
    "auth_step2": "2. Veuillez créer un compte de développeur Daikin et y ajouter une « application » pour obtenir un identifiant client et un secret client. Vous pouvez laisser le champ \"URL de redirection\" vide pour cette étape d'inscription.",
    "auth_step3": "3. Veuillez saisir l'ID client et le secret dans les champs ci-dessous.",
    "auth_step4": "4. Appuyez sur ce bouton pour obtenir l'URL de redirection... (Ignorez le titre « Erreur » de la fenêtre contextuelle)",
    "auth_step5": "5. Modifiez l'application dans le portail des développeurs Daikin et ajoutez l'URL de redirection que vous avez obtenue à l'étape précédente !",
    "auth_step6": "6. Appuyez sur le bouton suivant pour vous authentifier auprès du Daikin Cloud dans une nouvelle fenêtre/un nouvel onglet. Si la fenêtre ne s'ouvre pas, <b>veuillez vérifier les paramètres de votre bloqueur de popups pour autoriser les popups</b> !",
    "auth_step7": "7. Authentifiez-vous avec Daikin Cloud",
    "auth_step8": "8. Après l'authentification réussie et après avoir vu la page de réussite dans l'autre fenêtre, enregistrez les paramètres et appuyez sur le bouton « Enregistrer et fermer » ci-dessous !",
    "polling_header": "Intervalles d'interrogation des données",
    "polling_info": "Le cloud Daikin introduit des limitations de débit pour l'API. La limite principale est de <b>200 demandes maximum par jour</b> ! Utilisez l'interrogation lente lorsque des mises à jour fréquentes ne sont pas nécessaires. Veuillez définir l'état <b>useSlowPolling</b> sur true pour utiliser l'intervalle d'interrogation lent ! Les derniers détails sur les limites de débit peuvent être trouvés dans les états info.*.",
    "polling_interval": "Intervalle d'interrogation des données",
    "polling_interval_slow": "Intervalle lent d'interrogation des données"
}
